Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopedInnerEdge
Inner loops of a footprint sketch may not have slope-defining lines.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopeZero
Adjusting this Line's Overhang will not affect its height because its slope is zero.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopeTailInsideSlopeLine
The tails of slope arrows must not lie in interior of slope defining lines.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesDeleted
Some slab shape edit vertices were deleted because the Floor or Roof has changed its shape.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesCoincident
Some slab shape edit vertices were too close to each other or too close to an edge.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedTooThin
The Floor or Roof is too thin for its given type.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotOnlyLines
The Roof or Floor may only contain straight lines.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotHorz
The Roof or Floor is no longer horizontal.

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeEditFailedError
Slab Shape Edit failed. [Description]

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeEditFailed
Slab Shape Edit failed. [Description]

Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures
Failures about SlabShape.